sterentev/atdf-device-asm-include/inc/AT90PWM161.inc
; ----------	Register AC3ECON bits		------------------------
.equ	AC3OI		= 5		; 0x20 - Analog Comparator Output Invert
.equ	AC3OE		= 4		; 0x10 - Analog Comparator Output Enable
.equ	AC3H_MASK	= 0x07		;      - Analog Comparator Hysteresis Select (3 bits)
.equ	AC3H0		= 0		;          AC3H BIT0 position

; ----------	Register AC2ECON bits		------------------------
.equ	AC2OI		= 5		; 0x20 - Analog Comparator Output Invert
.equ	AC2OE		= 4		; 0x10 - Analog Comparator Output Enable
.equ	AC2H_MASK	= 0x07		;      - Analog Comparator Hysteresis Select (3 bits)
.equ	AC2H0		= 0		;          AC2H BIT0 position

; ----------	Register AC1ECON bits		------------------------
.equ	AC1OI		= 5		; 0x20 - Analog Comparator Output Invert
.equ	AC1OE		= 4		; 0x10 - Analog Comparator Output Enable
.equ	AC1ICE		= 3		; 0x08 - Analog Comparator Interrupt Capture Enable
.equ	AC1H_MASK	= 0x07		;      - Analog Comparator Hysteresis Select (3 bits)
.equ	AC1H0		= 0		;          AC1H BIT0 position



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	RSTDIS		= 3		; 0x08 - Reset Pin Disable
.equ	CKRC81		= 2		; 0x04 - Frequency Selection of the Calibrated RC Oscillator
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - 
.equ	CLKPS_MASK	= 0x0F		;      -  (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Reserved
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Reserved

; ----------	Register GPIOR2 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 2 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR1 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 1 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR0 bits		------------------------
.equ	GPIOR07		= 7		; 0x80 - General Purpose IO Register 0 bit 7
.equ	GPIOR06		= 6		; 0x40 - General Purpose IO Register 0 bit 6
.equ	GPIOR05		= 5		; 0x20 - General Purpose IO Register 0 bit 5
.equ	GPIOR04		= 4		; 0x10 - General Purpose IO Register 0 bit 4
.equ	GPIOR03		= 3		; 0x08 - General Purpose IO Register 0 bit 3
.equ	GPIOR02		= 2		; 0x04 - General Purpose IO Register 0 bit 2
.equ	GPIOR01		= 1		; 0x02 - General Purpose IO Register 0 bit 1
.equ	GPIOR00		= 0		; 0x01 - General Purpose IO Register 0 bit 0

; ----------	Register PLLCSR bits		------------------------
.equ	PLLF_MASK	= 0x3C		;      -  (4 bits)
.equ	PLLF0		= 2		;          PLLF BIT0 position
.equ	PLLE		= 1		; 0x02 - PLL Enable
.equ	PLOCK		= 0		; 0x01 - PLL Lock Detector

; ----------	Register PRR bits		------------------------
.equ	PRPSC2		= 7		; 0x80 - Power Reduction PSC2
.equ	PRPSCR		= 5		; 0x20 - Power Reduction PSC0
.equ	PRTIM1		= 4		; 0x10 - Power Reduction Timer/Counter1
.equ	PRSPI		= 2		; 0x04 - Power Reduction Serial Peripheral Interface
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC

; ----------	Register CLKCSR bits		------------------------
.equ	CLKCCE		= 7		; 0x80 - Clock Control Change Enable
.equ	CLKRDY		= 4		; 0x10 - Clock Ready Flag
.equ	CLKC_MASK	= 0x0F		;      - Clock Control (4 bits)
.equ	CLKC0		= 0		;          CLKC BIT0 position

; ----------	Register CLKSELR bits		------------------------
.equ	COUT		= 6		; 0x40 - Clock OUT
.equ	CSUT_MASK	= 0x30		;      - Clock Start up Time (2 bits)
.equ	CSUT0		= 4		;          CSUT BIT0 position
.equ	CKSEL_MASK	= 0x0F		;      - Clock Source Select (4 bits)
.equ	CKSEL0		= 0		;          CKSEL BIT0 position

; ----------	Register BGCCR bits		------------------------
.equ	BGCC_MASK	= 0x0F		;      -  (4 bits)
.equ	BGCC0		= 0		;          BGCC BIT0 position

; ----------	Register BGCRR bits		------------------------
.equ	BGCR_MASK	= 0x0F		;      -  (4 bits)
.equ	BGCR0		= 0		;          BGCR BIT0 position



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	NVMBSY		= 7		; 0x80 - None Volatile Busy Memory Busy
.equ	EEPAGE		= 6		; 0x40 - EEPROM Page Access
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMWE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEWE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable



; ====	PSC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PFRC0B bits		------------------------
.equ	PCAE0B		= 7		; 0x80 - PSC 0 Capture Enable Input Part B
.equ	PISEL0B		= 6		; 0x40 - PSC 0 Input Select for Part B
.equ	PELEV0B		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part B
.equ	PFLTE0B		= 4		; 0x10 - PSC 0 Filter Enable on Input Part B
.equ	PRFM0B_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM0B0		= 0		;          PRFM0B BIT0 position

; ----------	Register PFRC0A bits		------------------------
.equ	PCAE0A		= 7		; 0x80 - PSC 0 Capture Enable Input Part A
.equ	PISEL0A		= 6		; 0x40 - PSC 0 Input Select for Part A
.equ	PELEV0A		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part A
.equ	PFLTE0A		= 4		; 0x10 - PSC 0 Filter Enable on Input Part A
.equ	PRFM0A_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM0A0		= 0		;          PRFM0A BIT0 position

; ----------	Register PCTL0 bits		------------------------
.equ	PPRE0_MASK	= 0xC0		;      - PSC 0 Prescaler Selects (2 bits)
.equ	PPRE00		= 6		;          PPRE0 BIT0 position
.equ	PBFM0_MASK	= 0x24		;      - PSC 0 Balance Flank Width Modulation (2 bits)
.equ	PAOC0B		= 4		; 0x10 - PSC 0 Asynchronous Output Control B
.equ	PAOC0A		= 3		; 0x08 - PSC 0 Asynchronous Output Control A
.equ	PCCYC0		= 1		; 0x02 - PSC0 Complete Cycle
.equ	PRUN0		= 0		; 0x01 - PSC 0 Run

; ----------	Register PCNF0 bits		------------------------
.equ	PFIFTY0		= 7		; 0x80 - PSC 0 Fifty
.equ	PALOCK0		= 6		; 0x40 - PSC 0 Autolock
.equ	PLOCK0		= 5		; 0x20 - PSC 0 Lock
.equ	PMODE0_MASK	= 0x18		;      - PSC 0 Mode (2 bits)
.equ	PMODE00		= 3		;          PMODE0 BIT0 position
.equ	POP0		= 2		; 0x04 - PSC 0 Output Polarity
.equ	PCLKSEL0	= 1		; 0x02 - PSC 0 Input Clock Select

